title: Detects nltestrk.exe usage for domain trust enumeration
id: a4cf7e8b-4a78-4dd3-8fac-c08dc64dfca7
description: Detects the execution of nltestrk.exe with arguments related to domain trust enumeration.
author: Inovasys
date: 2023/09/27
status: experimental
references:
  - https://www.elastic.co/guide/en/security/current/prebuilt-rule-8-3-2-enumerating-domain-trusts-via-nltest-exe.html
tags:
  - attack.discovery
logsource:
    category: process_creation
    product: windows
detection:
  process_execution:
    Image|endswith: nltest.exe
    CommandLine|contains:
      - "/domain_trusts"
      - "/all_trusts"
      - "/dclist"
  condition: process_execution
falsepositives:
  - Unknown
level: high
