title: PUA - Rclone Execution
id: e37db05d-d1f9-49c8-b464-cee1a4b11638
related:
    - id: a0d63692-a531-4912-ad39-4393325b2a9c
      type: obsoletes
    - id: cb7286ba-f207-44ab-b9e6-760d82b84253
      type: obsoletes
status: test
description: Detects execution of RClone utility for exfiltration as used by various ransomwares strains like REvil, Conti, FiveHands, etc
references:
    - https://research.nccgroup.com/2021/05/27/detecting-rclone-an-effective-tool-for-exfiltration/
    - https://thedfirreport.com/2021/03/29/sodinokibi-aka-revil-ransomware
    - https://us-cert.cisa.gov/ncas/analysis-reports/ar21-126a
    - https://labs.sentinelone.com/egregor-raas-continues-the-chaos-with-cobalt-strike-and-rclone
    - https://www.splunk.com/en_us/blog/security/darkside-ransomware-splunk-threat-update-and-detections.html
author: Bhabesh Raj, Sittikorn S, Aaron Greetham (@beardofbinary) - NCC Group, Inovasys_Osama_Zidan
date: 2021/05/10
modified: 2024/07/15
tags:
    - attack.exfiltration
    - attack.t1567.002
logsource:
    product: windows
    category: process_creation
detection:
    # selection_specific_options:  # Filtered out since rclone execution is not prevalent in our environment
    #     CommandLine|contains|all:
    #         - '--config '
    #         - '--no-check-certificate '
    #         - ' copy '
    selection_rclone_img:
        - Image|endswith: '\rclone.exe'
        - Description: 'Rsync for cloud storage'
    selection_rclone_cli:
        CommandLine|contains:
            - 'pass'
            - 'user'
            - 'copy'
            - 'sync'
            - 'config'
            - 'lsd'
            - 'remote'
            - 'ls'
            - 'mega'
            - 'pcloud'
            - 'ftp'
            - 'ignore-existing'
            - 'auto-confirm'
            - 'transfers'
            - 'multi-thread-streams'
            - 'no-check-certificate '
    condition: all of selection_rclone_*
fields:
    - CommandLine
    - ParentCommandLine
    - Details
falsepositives:
    - Unknown
level: high
---
title: Rclone DNS query 
id: bc3d9bc5-7b0b-46b2-8927-6935d0d536d4
status: stable
description: Detect DNS query 
references:
    - https://research.nccgroup.com/2021/05/27/detecting-rclone-an-effective-tool-for-exfiltration/
author: Inovasys_Osama_Zidan
date: 2023/09/20
tags:
    - attack.exfiltration
    - attack.t1567.002
logsource:
    product: windows
    service: sysmon
    definition: Deploy Sysmon (System Monitor) on Windows systems by downloading and running the Sysmon installer
detection:
    dns_query:
        Image|endswith: '\rclone.exe'
    condition: dns_query
falsepositives:
    - Legitimate usage by normal users or admins
level: medium
