title: Inbox Rule with Suspicious Condition Search String
id: 092a3d28-7c4f-4d46-9d7c-e7fc3ba7c052
status: experimental
description: Detects inbox rule modification with a condition that contains suspicious strings used at times by attackers.
references: https://redcanary.com/threat-detection-report/techniques/email-forwarding-rule/
tags:
    - inovasys.public
    - attack.collection
    - attack.t1114.003
    - attack.defense_evasion
    - attack.t1564.008
author: Inovasys
date: 2024/03/27
level: medium
Language: KQL
Prerequisites: CloudAppEvents
Query: |
'let suspicious_strings = dynamic(["ACH","Invoice","Payroll","Password Reset","Login code"]);
CloudAppEvents
| where Application == "Microsoft Exchange Online"
| where ActionType == @"UpdateInboxRules"
| mv-expand ActivityObjects
| where ActivityObjects["Name"] == "RuleCondition" and ActivityObjects["Value"] != "{}" 
| where ActivityObjects["Value"] has_any(suspicious_strings)'