title: Bits Cmdlet Download
id: ec627e5f-29f6-41b9-b2db-9b75d8448f37
status: experimental
description: Detect usage of BITS Commandlets to download files from a remote server. 
references:
    - https://www.ired.team/offensive-security/persistence/t1197-bits-jobs
    - https://lolbas-project.github.io/lolbas/Binaries/Bitsadmin/

tags:
    - inovasys.public
    - attack.command_and_control
    - attack.t1105

author: Inovasys
date: 2023/10/04

logsource:
    product: windows
    service: ps_script
detection:
    bits_cmdlet_download_source:
        ScriptBlockText|contains|all: 
            - '-Source "http'
            - '-Source http'
            - "-Source 'http"
    bits_cmdlet_download_type:
        ScriptBlockText|contains:
            - '-TransferType Download'
    bits_start:
        ScriptBlockText|contains: 'Start-BitsTransfer'
    
    condition: bits_start and 1 of bits_cmdlet_*

falsepositives:
    - Legitimate transfer by admins, however this technique is not seen frequently and should be investigated
fields:
    - ScriptBlockText
    
level: medium
---
title: Bitsadmin Download
id: 339ad2e9-a3c7-4c06-9a36-8ad76e48372e
status: experimental
description: Detect usage of bitsadmin.exe to download files from a remote server. 
references:
    - https://www.ired.team/offensive-security/persistence/t1197-bits-jobs
    - https://lolbas-project.github.io/lolbas/Binaries/Bitsadmin/

tags:
    - inovasys.public
    - attack.command_and_control
    - attack.t1105

author: Inovasys
date: 2023/10/04

logsource:
    product: windows
    category: process_creation 
detection:
    bitsadmin_exec:
        - Image|endswith: '\bitsadmin.exe'
        - OriginalFileName: 'bitsadmin.exe'
    bitsadmin_commandline:
        CommandLine|contains|all: 
            - '/download'
            - '/transfer'
    
    condition: bitsadmin_exec and bitsadmin_commandline

falsepositives:
    - Legitimate transfer by admins
    
level: medium