title: Obfuscated Script Launch Using ExecutionPolicy Bypass
id: 934831d6-078c-4d5b-8fa4-6bad2d0b6688
status: experimental
description: Detects the execution of PowerShell or CMD processes that use ExecutionPolicy Bypass in combination with common
             evasion parameters such as -WindowStyle Hidden or -EncodedCommand. This behavior is frequently associated with
             malicious scripts, obfuscated payload execution, and defense evasion techniques used by threat actors and malware.
references:
    - https://www.picussecurity.com/resource/blog/cavalry-werewolf-apt
author: Inovasys_Manar_Mamdouh
date: 2025-10-31
tags:
  - attack.execution
  - attack.t1059.001
  - attack.t1562.001
logsource:
    product: windows
    category: process_creation
detection:
    selection_image:
        Image|endswith:
            - '\powershell.exe'
            - '\pwsh.exe'
            - '\cmd.exe'
    execution_policy_bypass:
        CommandLine|contains:
            - '-ExecutionPolicy Bypass'
            - '-ep Bypass'
            - '-exec Bypass'
    evasion_flags:
        CommandLine|contains:
          - '-WindowStyle Hidden'
          - '-EncodedCommand'
    condition: selection_image and (execution_policy_bypass and evasion_flags)
level: high
