title: Windows Explorer Spawning CMD with Start and Exit Commands
id: 2a92874e-da37-41ef-ae47-0993de2da903
status: experimental
description: Detects explorer.exe spawning cmd.exe along with corresponding start and exit commands that commonly observe suspiouse lnk files
references:
    - https://redcanary.com/threat-detection-report/techniques/windows-command-shell/
author: Inovasys
date: 2024/03/27
tags:
    - attack.execution
    - attack.t1059
    - attack.t1059.003
    - attack.t1053
logsource:
    category: process_creation
    product: windows
detection:
    parent_explorer:
        ParentImage|endswith: '\explorer.exe'
    cmd_process:
        - Image|endswith: '\cmd.exe'
        - OriginalFileName: 'Cmd.Exe'

    cmd_cli:
        CommandLine|contains|all:
            - 'start'
            - 'exit'
    condition: all of them

falsepositives:
    - Unknown
level: low
