title: wmiprvse.exe spawning suspicious child processes
id: 9d49c39a-05a2-429b-989b-0d02bce1fd00
status: experimental
description: Detects Windows Management Instrumentation (wmiprvse.exe) suspicious child processes, potentially indicating an attempt to conceal the execution of malicious code
references:
    - https://redcanary.com/threat-detection-report/techniques/windows-command-shell/
author: Inovasys
date: 2024/03/27
tags:
    - attack.persistence
    - attack.t1047

logsource:
    category: process_creation
    product: windows

detection:
    wmi_parent_img:
        ParentImage|endswith: '\wmiprvse.exe'

    suspicious_child_img:
        - Image|endswith:
            - '\rundll32.exe'
            - '\msbuild.exe'
            - '\certutil.exe'
            - '\wscript.exe'
            - '\cscript.exe'
            - '\regsvr32.exe'
        - OriginalFileName:
            - 'RUNDLL32.EXE'
            - 'MSBuild.exe'
            - 'CertUtil.exe'
            - 'wscript.exe'
            - 'cscript.exe'
            - 'REGSVR32.EXE'

    suspicious_child_img_cmd:
        - Image|endswith: '\cmd.exe'
        - OriginalFileName: 'Cmd.Exe'

    suspicious_child_img_cmd_cli:
        CommandLine|contains|all:
            - 'cmd'
            - '/c'

    condition: wmi_parent_img and (suspicious_child_img or (suspicious_child_img_cmd and suspicious_child_img_cmd_cli))

falsepositives:
    - Unknown
level: high
