title: Impacket atexec.py execution
id: 761e2011-0ac3-4958-b039-dbb9c249f716
status: experimental
description: Detects specific commandline terms that are found when atexec.py is executed. 
references:
    - https://redcanary.com/threat-detection-report/threats/impacket/

tags:
    - attack.execution

author: Inovasys
date: 2024/03/28

logsource:
    product: windows
    category: process_creation
detection:
    exec_parent:
        ParentImage|endswith: 
            - '\svchost.exe'
            - '\taskeng.exe'
    exec_commandline:
        CommandLine|contains|all:
            - 'cmd.exe'
            - '/c'
            - 'windows\temp'
            - ' > '
            - '2>&1'

    condition: all of exec_*
falsepositives:
    - Unknown

level: high
---
title: Impacket SMBexec execution
id: ece673a0-b12f-4b62-b5f3-210356102482
status: experimental
description: Detects specific commandline terms that are found when wmiexec is executed. 
references:
    - https://redcanary.com/threat-detection-report/threats/impacket/

tags:
    - attack.execution

author: Inovasys
date: 2024/03/28

logsource:
    product: windows
    category: process_creation
detection:
    exec_parent:
        ParentImage|endswith: '\services.exe'
    exec_proc:
        - Image|endswith: 'cmd.exe'
        - OriginalFileName: 'Cmd.Exe' 
    exec_commandline:
        CommandLine|contains:
            - '/Q'
            - '/c'
            - 'echo'
            - '^> '
            - ' 2^>^&1 > '

    condition: all of exec_*
falsepositives:
    - Unknown

level: medium
---
title: Impacket WMIexec execution
id: fe5ee7d8-931b-49f3-98ad-5a8e0d860f1a
status: experimental
description: Detects specific commandline terms that are found when wmiexec is executed. 
references:
    - https://redcanary.com/threat-detection-report/threats/impacket/

tags:
    - attack.execution

author: Inovasys
date: 2024/03/28

logsource:
    product: windows
    category: process_creation
detection:
    exec_parent:
        ParentImage|endswith: 'wmiprvse.exe'
    exec_proc:
        - Image|endswith: 'cmd.exe'
        - OriginalFileName: 'Cmd.Exe' 
    exec_commandline:
        CommandLine|contains:
            - 'cmd.exe /Q /c '
            - ' 1> \\'
            - ' 2>&1'

    condition: all of exec_*
falsepositives:
    - Unknown

level: high