title: executables execution in temp folder using cmd
id: 486ce9ea-0faa-4237-a883-15a960a67d88
status: experimental
description: Detects the execution of files in \AppData\local\temp folder using cmd commands which can indicate a malicious activity
references:
    - https://www.cyfirma.com/research/the-persistent-danger-of-remcos-rat/
author: Inovasys
date: 2024/08/25
tags:
    - inovasys.public
    - attack.execution
    - attack.t1059.003

logsource:
    product: windows
    category: process_creation

detection:
    selection_parent_img:
        ParentImage|endswith: '\cmd.exe'

    selection_execution_cmdlts:
        CommandLine|contains: '/c'

    selection_path:
        CommandLine|contains: '\AppData\Local\Temp'


    condition: selection_parent_img and selection_execution_cmdlts and selection_path

falsepositives: Legitimate files executions in temp folder by legitimate installers
level: medium