id: 616150f8-89a8-48fd-a839-ca605849ccb4
title: Potential Credential Access via System Files
status: experimental
description: Detects any trials of credential access from /etc/passwd, /etc/shadow, /etc/pam.d/*.
references:
    - https://tldp.org/LDP/lame/LAME/linux-admin-made-easy/shadow-file-formats.html
author: Inovasys
date: 2024/1/22
tags:
    - attack.credential_access
    - attack.t1003.008

logsource:
    product: linux
    service: auditd
    definition: 'Add this configuration to your auditd rules. -w /etc/passwd -p wa -k etcpasswd, -w /etc/shadow -k etcpasswd, -w /etc/pam.d/ -p wa -k pam'

detection:
    access_passwd:
        file.name: /etc/passwd
    
    access_shadow:
        file.name: /etc/shadow
    
    access_pam:
        directory.name: /etc/pam.d

    condition: 1 of access_*

falsepositives:
    - Legitimate process or aminstrator accessed /etc/passwd, /etc/shadow, or /etc/pam.d/*
level: high