title: Loading malicious browser extentions using powershell
id: 4fa3c953-a195-4e1a-ae07-423697ddfd95
status: experimental
description: Detects Loading browser extentions using powershell that may be an indicator of malicious activity.
references:
    - https://reasonlabs.com/research/new-widespread-extension-trojan-malware-campaign

author: Inovasys
date: 2024/09/11
tags:
    - inovasys.public
    - attack.execution
    - attack.t1059.001
logsource:
    product: windows
    category: ps_script
detection:
    selection_cmdlets:
        ScriptBlockText|contains:  'load-extension'
    condition: selection_cmdlets
falsepositives:
    - Legitimate extentions loading 
level: medium