title: Suspicious Email Attachments with Fake Official or Urgent Lures
id: 1f956d9f-5ca8-4739-956e-dfa2a614c3aa
status: experimental
description: Detects emails containing attachments with filenames suggesting urgency or official nature
  (e.g., "urgent", "invoice", "salary") combined with executable or macro-enabled file types  often used 
  in phishing and malware delivery campaigns.
references:
  - https://www.picussecurity.com/resource/blog/cavalry-werewolf-apt
author: Inovasys_Manar_Mamdouh
date: 2025-10-31
tags:
  - attack.initial_access
  - attack.t1566.001
logsource:
  product: m365
  service: exchange
detection:
  selection_keywords:
     FileName|contains:
        - 'bonus'
        - 'payout'
        - 'layoff'
        - 'termination'
        - 'urgent'
        - 'immediate'
        - 'confidential'
        - 'invoice'
        - 'salary'
        - 'payment'
        - 'results'
        - 'award'
        - 'audit'
        - 'project'
        - 'official'
        - 'legal'
        - 'subpoena'
        - 'money'
        - 'review'
        - 'transaction'
  condition: selection_keywords
falsepositives:
  - Legitimate internal emails using these terms for business purposes
level: medium
