title: Rundll32.EXE Calling DllRegisterServer Export Function Explicitly
id: 7daabab8-b98a-4ad0-9b8c-12336e40ef28
related:
    - id: d81a9fc6-55db-4461-b962-0e78fea5b0ad # Original from sigma
      type: similar
status: experimental
description: |
    Detects when the DLL export function 'DllRegisterServer' is called in the commandline by Rundll32 explicitly where the DLL is located in a non-standard path.
references:
    - https://thedfirreport.com/2023/08/28/html-smuggling-leads-to-domain-wide-ransomware/
    - https://www.virustotal.com/gui/file/94816439312563db982cd038cf77cbc5ef4c7003e3edee86e2b0f99e675ed4ed/behavior
    - https://learn.microsoft.com/en-us/windows/win32/api/olectl/nf-olectl-dllregisterserver
    - https://redcanary.com/threat-detection-report/techniques/rundll32/

author: Andreas Braathen (mnemonic.io), Inovasys
date: 2023/10/17
modified: 2024/03/28
tags:
    - inovasys.public
    - attack.defense_evasion
    - attack.t1218.011
logsource:
    category: process_creation
    product: windows
detection:
    selection_image:
        - Image|endswith: '\rundll32.exe'
        - OriginalFileName: 'RUNDLL32.EXE'
    selection_cmdline:
        CommandLine|contains: 'DllRegisterServer'
    condition: all of selection_*
falsepositives:
    - Legitimate usage as part of application installation, but less likely from e.g. temporary paths.
    - Not every instance is considered malicious, but this rule will capture the malicious usages.
level: medium