title: Impacket Svchost Image Load
id: e013c20c-c8b6-4ff2-b155-6d0345fc1287
status: experimental
description: Detects specific svchost.exe image load when secretsdump module is used. 
references:
    - https://redcanary.com/threat-detection-report/techniques/rundll32/

tags:
    - inovasys.public
    - attack.credential_access
    - attack.t1003

author: Inovasys
date: 2024/03/27

logsource:
    product: windows
    category: image_load
detection:
    load_regsvc:
        Image|endswith: '\svchost.exe'
        ImageLoaded|endswith: '\regsvc.dll'

    condition: load_regsvc
falsepositives:
    - Unknown

level: high
---
title: Impacket Svchost Image Load
id: b0f62594-4367-4d8d-98b7-5d76170bb52a
related:
    - id: e013c20c-c8b6-4ff2-b155-6d0345fc1287
      type: similar
status: experimental
description: Detects specific svchost.exe commandline when secretsdump module is used. 
references:
    - https://redcanary.com/threat-detection-report/techniques/rundll32/

tags:
    - inovasys.public
    - attack.credential_access
    - attack.t1003

author: Inovasys
date: 2024/03/27

logsource:
    product: windows
    category: process_creation
detection:
    svchost_exec:
        - Image|endswith: '\svchost.exe'
        - OriginalFileName: 'svchost.exe'
    svchost_commandline:
        CommandLine|contains: '-k localService -p -s RemoteRegistry' 
    condition: svchost_exec and svchost_commandline
falsepositives:
    - Unknown

level: high