title: Suspicious Commands Related to Deletion of Shadowcopies
id: 253064ef-2a30-468c-8e0d-a26daa0d20e6
status: experimental
description: Detects potential attempts to hinder system recovery by employing legitimate Windows tools to delete Shadow Copies, commonly seen in ransomware attacks.
references:
    - https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/vssadmin-delete-shadows
    - https://www.bvanleeuwen.nl/faq/?p=813
    - https://www.fortinet.com/blog/threat-research/stomping-shadow-copies-a-second-look-into-deletion-methods
author: Inovasys
date: 2023/08/23
tags:
    - attack.Impact
    - attack.t1490
    - car.2021-01-009

logsource:
    category: process_creation
    product: windows
detection:
    selection_img_wmic:
        - Image|endswith: '\wmic.exe'
        - OriginalFileName: 'wmic.exe'

    selection_commandline_wmic:
        CommandLine|contains|all:
            - 'shadowcopy'
            - 'delete'

    selection_img_vssadmin:
        - Image|endswith: '\vssadmin.exe'
        - OriginalFileName: 'VSSADMIN.EXE'

    selection_commandline_vssadmin_1:
        CommandLine|contains|all:
            - 'delete'
            - 'shadows'

    selection_commandline_vssadmin_2:
        CommandLine|contains|all:
            - 'resize'
            - 'shadowstorag'

    selection_img_powershell:
        - Image|endswith: '\powershell.exe'
        - OriginalFileName: 'PowerShell.EXE'

    Win32_ShadowCopy_select:
        CommandLine|contains:
            - 'Win32_ShadowCopy'

    Win32_ShadowCopy_delete:
        CommandLine|contains:
            - 'Delete'
            - 'Remove'
            - 'rwmi'
            - 'rcim'
    condition: (selection_img_wmic and selection_commandline_wmic) or (selection_img_vssadmin and 1 of selection_commandline_vssadmin_*) or (selection_img_powershell and all of Win32_ShadowCopy_*)

falsepositives:
    - Legitimate administrator or windows proccess deleted shadow copies
level: high
---
title: Suspicious Commands Related to Deletion of Shadowcopies
id: 02ffb04d-a70d-4687-9e31-a81b57ab7d42
status: experimental
description: Detects potential attempts to hinder system recovery by employing powershell scripts to delete Shadow Copies 
references:
    - https://www.fortinet.com/blog/threat-research/stomping-shadow-copies-a-second-look-into-deletion-methods
author: Inovasys
date: 2023/08/28
tags:
    - attack.Impact
    - attack.t1490

logsource:
    product: windows
    category: ps_script
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    selection_win32_shadowcopy_select:
        ScriptBlockText|contains:
            - 'Win32_ShadowCopy'

    selection_win32_shadowcopy_delete:
        ScriptBlockText|contains:
            - 'Delete'
            - 'Remove'
            - 'rwmi'
            - 'rcim'
    condition: selection_win32_shadowcopy_select and selection_win32_shadowcopy_delete

falsepositives:
    - Legitimate administrator or windows proccess deleted shadow copies using powershell
level: high

---

title: Suspicious Commands Related to Deletion of Shadowcopies
id: df3a0658-1ffa-4d64-9a93-0ba223ab22e5
status: experimental
description: Detects potential attempts to hinder system recovery by employing powershell scripts to delete Shadow Copies, commonly seen in ransomware attacks.
references:
    - https://www.fortinet.com/blog/threat-research/stomping-shadow-copies-a-second-look-into-deletion-methods
author: Inovasys
date: 2023/08/28
tags:
    - attack.Impact
    - attack.t1490

logsource:
    product: windows
    category: ps_classic_start

detection:
    shadowcopy_select:
        Data|contains:
            - 'Win32_ShadowCopy'

    shadowcopy_delete:
        Data|contains:
            - 'Delete'
            - 'Remove'
            - 'rwmi'
            - 'rcim'

    condition: shadowcopy_select and shadowcopy_delete

falsepositives:
    - Legitimate administrator or windows proccess deleted shadow copies using powershell
level: high

---

title: Suspicious Process Manipulating Shadowcopies
id: 8296ccd3-cee3-477f-81b3-c9f0d3120353
status: experimental
description: Detects suspicious process attempting to manipulation of shadow copies
references:
    - https://www.fortinet.com/blog/threat-research/stomping-shadow-copies-a-second-look-into-deletion-methods
author: Inovasys
date: 2023/08/28
tags:
    - attack.Impact
    - attack.t1490

logsource:
    category: image_load
    product: windows
detection:
    loaded_dll:
        ImageLoaded|endswith: '\vss_ps.dll'

    filter_legit:
        Image|startswith: 'C:\Windows\'
        Image|endswith:
            - '\clussvc.exe'
            - '\dismhost.exe'
            - '\dllhost.exe'
            - '\inetsrv\appcmd.exe'
            - '\inetsrv\iissetup.exe'
            - '\msiexec.exe'
            - '\rundll32.exe'
            - '\searchindexer.exe'
            - '\srtasks.exe'
            - '\svchost.exe'
            - '\taskhostw.exe'
            - '\thor.exe'
            - '\thor64.exe'
            - '\vssadmin.exe'
            - '\tiworker.exe'
            - '\vssvc.exe'
            - '\WmiPrvSE.exe'
            - '\System32\SystemPropertiesAdvanced.exe'

    condition: loaded_dll and not 1 of filter_*

falsepositives:
    - legitimate process manipulated shadow copies
level: medium
