title: OneDriveStandaloneUpdater Executed From CMD
id: 3402fa1d-5af7-4f7e-bbdd-882d8c29ca1a
status: experimental
description: Detects when OneDriveStandaloneUpdater.exe is launched from cmd.exe, which could indicate potential abuse for malicious purposes
references:
    - https://www.trendmicro.com/en_us/research/25/b/black-basta-cactus-ransomware-backconnect.html
author: Inovasys_Shreif_Mokhtar
date: 2025-04-06
tags:
    - attack.execution
    - attack.t1059.003
    - attack.defense-evasion
    - attack.t1218
    - inovasys.inspired_by_TI
logsource:
    product: windows
    category: process_creation
detection:
    selection:
        ParentImage|endswith: '\cmd.exe'
        Image|endswith: '\OneDriveStandaloneUpdater.exe'
    selection_embedding:
        CommandLine|contains: '-Embedding'
    condition: selection and selection_embedding
falsepositives:
    - Legitimate administrative use of OneDriveStandaloneUpdater via command line
    - Legitimate Microsoft update processes
level: medium
