title: Impacket Svchost Image Load
id: e013c20c-c8b6-4ff2-b155-6d0345fc1287
status: experimental
description: Detects specific svchost.exe image load when secretsdump module is used. 
references:
    - https://redcanary.com/threat-detection-report/techniques/rundll32/

tags:
    - attack.credential_access
    - attack.t1003

author: Inovasys
date: 2024/03/27

logsource:
    product: windows
    category: image_load
detection:
    load_regsvc:
        Image|endswith: '\svchost.exe'
        ImageLoaded|endswith: '\regsvc.dll'

    condition: load_regsvc
falsepositives:
    - Unknown

level: high