title: Taskkill with IMAGENAME Filter
id: c47a8b69-8d1e-49e2-8d75-c1b1c4929fb3
status: experimental
description: Detects the use of taskkill.exe with the filter command /fi which can be used to look for process based on patterns.
referance:
   - https://www.trendmicro.com/en_us/research/24/i/how-ransomhub-ransomware-uses-edrkillshifter-to-disable-edr-and-.html

author: Inovasys_Salem_Salem
date: 2024/11/03
tags:
  - attack.defense_evasion
  - attack.t1562.001
logsource:
   category: process_creation
   product: windows
detection:
   selection_taskkill:
      - Image|endswith: '\taskkill.exe'
      - OriginalFileName: 'taskkill.exe'
   selection_cmdline:
      CommandLine|contains|all|windash:
         - '/F '
         - '/fi '
      CommandLine|contains|all: 
         - ' IMAGENAME '
         - ' eq '
   condition: all of selection_*
falsepositives:
   - Unknown
level: high