title: Creation of .xd File Extension
id: 0b7a944f-9c3e-4e5f-95b6-68c35ecb3fd1
status: experimental
description: Detects the creation of files with the '.xd' extension,  This detection is useful in environments where .xd files are uncommon or unauthorized and related to Deerstealer malware .
author: Inovasys_Mahmoud_Osama
date: 2025-06-30
tags:
    - inovasys.public
    - attack.defense_evasion
    - attack.t1027   
logsource:
    product: windows
    category: file_creation  
detection:
    selection:
        TargetFilename|endswith: 
          - '.xd'
    condition: selection
level: medium

