title: Browser Credential Store Access
id: 9c1c5a09-11b4-4731-90da-141e4ee8ae5c
status: experimental
description: Detects suspicious processes based on name and location that access the browser credential stores which can be the sign of credential stealing.
references:
    - https://book.hacktricks.xyz/generic-methodologies-and-resources/basic-forensic-methodology/specific-software-file-type-tricks/browser-artifacts

tags:
    - inovasys.public
    - attack.credential_access
    - attack.t1555.003

author: Inovasys
date: 2023/11/30

logsource:
    product: windows
    service: security
    definition: 'Enabling the advanced audit policy (Object Access) for Success/Failure is a prerequisite. Configure it via GPO (Computer Configuration) > (Windows Settings) > (Security Settings) > (Advanced Audit Policy Configuration) > (Audit Policies) > (Object Access).'
detection:
    suffix:
        Image|startswith:
            - 'C:\Program Files\\'
            - 'C:\Program Files (x86)\\'
        Image|endswith:
            - 'chrome.exe'
            - 'firefox.exe'
            - 'msedge.exe'
            - 'MsSense.exe'
    event_id:
        EventID: 4663
    password_stores_edge:
        ObjectName|endswith:
            - '\Appdata\Local\Microsoft\Windows\WebCache\WebcacheV01.dat'
            - '\Appdata\Local\Microsoft\Windows\WebCache\WebcacheV16.dat'
            - '\Appdata\Local\Microsoft\Windows\WebCache\WebcacheV24.dat'
    password_stores_chrome:
        ObjectName|contains|all:
            - '\AppData\Local\Google\Chrome\User Data\\'
            - '\Login Data'
    password_stores_firefox:
        ObjectName|contains|all:
            - '\AppData\Roaming\Mozilla\Firefox\Profiles\\'
            - '\logins.json'
    cookies_store_chrome:
        ObjectName|contains|all:
            - '\AppData\Local\Google\Chrome\User Data\\'
            - '\Network\Cookies'
    cookies_store_firefox:
        ObjectName|contains|all:
            - '\AppData\Roaming\Mozilla\Firefox\Profiles\\'
            - '\cookies.sqlite'
    condition: event_id and (1 of password_stores_* or 1 of cookies_store_*) and not suffix

falsepositives:
    - Antivirus may access credential stores

level: high