title: Curl Spawned from PowerShell or cmd
id: 9b8442ba-0243-4fd3-abeb-21e7b1bcb83e
status: experimental
description: Detects the execution of curl.exe from powershell or cmd. Offten used by threat actors to download files
references:
    - https://www.cybereason.com/blog/unboxing-snake-python-infostealer-lurking-through-messaging-service
author: Inovasys
date: 2024/04/29
tags:
    - attack.command_and_control
    - attack.t1105

logsource:
    category: process_creation
    product: windows

detection:
    selection_img:
        - Image|endswith: '\curl.exe'
        - OriginalFileName: 'curl.exe'

    selection_parent:
        ParentImage|endswith:
            - '\cmd.exe'
            - '\powershell.exe'

    condition: selection_img and selection_parent

falsepositives:
    - Unknown
level: low
