title: Expand Command on CAB Files in Temp Directory
id: 36ef2a5c-f8e7-4b7a-b566-8cd46e2b638d
status: experimental
description: Detects the use of the "expand" command to extract CAB files in temporary directories, which may indicate malware unpacking or malicious file execution
references:
  - https://www.trendmicro.com/en_us/research/25/b/black-basta-cactus-ransomware-backconnect.html
author: Inovasys_Shreif_Mokhtar
date: 2025-03-26
tags:
  - attack.t1059.003
  - attack.defense-evasion
  - inovasys.inspired_by_TI
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    CommandLine|contains|all:
      - 'expand'
      - '.cab'
    CommandLine|contains: '\Users\*\AppData\Local\Temp'
  
  condition: selection
falsepositives:
  - Legitimate software installation processes that extract CAB files to the temp directory
  - System administrators performing legitimate software deployment tasks
level: medium
