title: Inbox Rule with Suspicious COndition Search String
id: 3b0724da-5980-460a-beec-3967bba6741a
status: experimental
description: Detects inbox rule modification with a condition that contains suspicious strings used at times by attackers.
references: https://redcanary.com/threat-detection-report/techniques/email-forwarding-rule/
tags: 
  - attack.collection
  - attack.t1114.003
author: Inovasys
date: 2024/03/27
level: medium
Language: KQL
Prerequisites: CloudAppEvents
Query: |
'let suspicious_strings = dynamic(["ACH","Invoice","Payroll","Password Reset","Login code"]);
CloudAppEvents
| where Application == "Microsoft Exchange Online"
| where ActionType == @"UpdateInboxRules"
| mv-expand ActivityObjects
| where ActivityObjects["Name"] == "RuleCondition" and ActivityObjects["Value"] != "{}" 
| where ActivityObjects["Value"] has_any(suspicious_strings)'