title: Twitter Dead Drop Resolver
id: 4693d519-b0dd-4530-b0a3-9061239a014c
status: experimental
description: Detects connections to a Twitter profile, where an attacker controlled account can have a status that contains an IP for a C2. The IP found on the profile can be used to determine whether there was successful C2 communication. 
references:
    - https://blog.bushidotoken.net/2021/04/dead-drop-resolvers-espionage-inspired.html

tags:
    - attack.command_and_control
    - attack.t1102.001

author: Inovasys
date: 2024/04/30

logsource:
    category: proxy
    definition: 'Enable and configure proxy logs to effectively capture both incoming and outgoing traffic.'
detection:
    twitter_channel_request:
        cs-host: 
            - 'twitter.com'
            - 'x.com'
    twitter_empty_request:
        cs-uri: '/'
    condition: twitter_channel_request and not twitter_empty_request
falsepositives:
    - Legitimate user navigating to benign profile
level: low
---
title: Twitter API Connections
id: a7e72a09-9f32-47b0-a8ce-3a50a4c13d75
status: experimental
description: Detects connections to the Twitter API endpoints, which can be a sign of using Twitter as a C2. A get request to the endpoint retrieves messages and a post request sends messages, this can be used to identify whether the C2 is uni or bidirectional.
references:
    - https://blog.bushidotoken.net/2021/04/dead-drop-resolvers-espionage-inspired.html

tags:
    - attack.command_and_control
    - attack.t1102.002
    - attack.exfiltration
    - attack.t1567

author: Inovasys
date: 2024/04/30

logsource:
    category: proxy
    definition: 'Enable and configure proxy logs to effectively capture both incoming and outgoing traffic.'
detection:
    api_base:
        cs-host: 'api.twitter.com'
    twitter_dms_v2:
        cs-uri|contains|all:
            - '/dm_conversations'
            - '/dm_events'
    twitter_posts_v2:
        cs-uri|startswith: '/2/tweets'
    twitter_users_v2:
        cs-uri|startswith: '/2/users'
    twitter_dms_v1:
        cs-uri|contains: '/direct_messages/events'
    twitter_posts_v1:
        cs-uri|contains: 
            - '/statuses/'
            - '/favorites/'
    twitter_users_v1:
        cs-uri|contains: 
            - '/users/'
    condition: api_base and 1 of twitter_*
falsepositives:
    - Legitimate Twitter API applications hosted on the environment
level: critical