id: d0193272-105c-48e8-a25b-11c61acb1a16
title: Manipulating accounts by modifying user's password 
status: experimental
description: Detects account manipulation using net user command to change user's password
references:
    - https://securelist.com/kaspersky-incident-response-report-2023/112504/
author: Inovasys
date: 2024/05/16
tags:
    - attack.persistence
    - attack.T1098
logsource:
    category: process_creation
    product: windows
detection:
    Path:
        Image|endswith:
              - '\net.exe'
              - '\net1.exe'
        CommandLine|startswith: 'Net user'
    condition: Path 
false positives:
- legitimate use of net user
level: high
