title: Web Application Access to Credential Files
id: ba547db9-601e-450f-bb7e-fbfb4104c211
status: experimental
description: Detects a web application worker (Node, Python) accessing files related to Kubernetes service account tokens or cloud configuration profiles.
references:
  - https://thedfirreport.com/2026/04/22/bissa-scanner-exposed-ai-assisted-mass-exploitation-and-credential-harvesting/
author: Manar_Mamdouh_Inovasys
date: 2026-6-03
tags:
    - attack.discovery
    - attack.t1613
logsource:
    category: file_access
    product: windows
detection:
    selection_process:
        Image|endswith:
            - '\w3wp.exe'
            - '\node.exe'
            - '\python.exe'
            - '\java.exe'
            - '\httpd.exe'
            - '\tomcat.exe'
    selection_target_paths:
        TargetFilename|contains:
            - 'kubernetes.io'
            - 'serviceaccount\token'
            - 'serviceaccount\namespace'
            - '.aws\credentials'
            - '.azure\credentials'
    condition: selection_process and selection_target_paths
falsepositives:
    - Legitimate cross-platform orchestration tooling or administrative backup scripts running under a Java/Node service wrapper.
level: low
