title: Suspicious Inbox Rule Name
id: 357f177c-a71c-4cb0-992e-021f7129fab5
status: experimental
description: Detects inbox rule modification with suspicious rule name.
references: https://redcanary.com/threat-detection-report/techniques/email-forwarding-rule/
tags: 
  - attack.collection
  - attack.t1114.003
author: Inovasys
date: 2024/03/26
level: medium 
Language: KQL
Prerequisites: CloudAppEvents
Query: |
'CloudAppEvents
| where Application == "Microsoft Exchange Online"
| where ActionType == @"UpdateInboxRules"
| mv-expand ActivityObjects
| where ActivityObjects["Name"] == "RuleName" and ActivityObjects["Value"] != "" 
| where tostring(ActivityObjects["Value"]) in (".","..","aaaaa","……",";") or strlen(tostring(ActivityObjects["Value"])) < 4'