title: Suspicious Lures Attachments with suspicious Extensions in Outlook Cache
id: 81654f68-7b38-429d-9240-6d1bb54a2432
status: experimental
description: Detects suspicious files staged in Outlook’s INetCache (\Microsoft\Windows\INetCache\Content.Outlook\)
      that have malicious or phishing-related names (e.g., bonus, urgent, invoice) and high-risk extensions
      (.exe, .zip, .js, .vbs, .docm, .xlsm, .pptm). This behavior typically indicates phishing or malicious payload delivery
author: Inovasys_Manar_Mamdouh
date: 2025-10-31
references:
  - https://www.picussecurity.com/resource/blog/cavalry-werewolf-apt
tags:
  - attack.t1566.001
  - attack.t1204.002
  - attack.t1553.005

logsource:
  category: file_event
  product: windows

detection:

  selection_path:
    TargetFilename|contains:
      - '\Microsoft\Windows\INetCache\Content.Outlook\'

  selection_suspicious_names:
    TargetFilename|contains:
      - 'bonus'
      - 'payout'
      - 'layoff'
      - 'termination'
      - 'urgent'
      - 'immediate'
      - 'confidential'
      - 'invoice'
      - 'salary'
      - 'payment'
      - 'results'
      - 'award'
      - 'audit'
      - 'project'
      - 'official'
      - 'legal'
      - 'subpoena'
      - 'money'
      - 'review'
      - 'transaction'

  selection_extensions:
    TargetFilename|endswith:
      - '.exe'
      - '.zip'
      - '.js'
      - '.vbs'
      - '.docm'
      - '.xlsm'
      - '.pptm'

  condition: selection_path and selection_suspicious_names and selection_extensions

level: high
