title: Suspicious Archive Files in Outlook Cache Directory
id: 81654f68-7b38-429d-9240-6d1bb54a2432
status: experimental
description: Detects creation of suspicious archive files with document-like names in Outlook INetCache directory,
    indicating potential phishing payloads downloaded by Outlook client.
author: Inovasys_Manar_Mamdouh
date: 2025-10-31
references:
   - https://www.picussecurity.com/resource/blog/cavalry-werewolf-apt
tags:
    - attack.t1566.001
    - attack.t1204.002
    - attack.t1553.005
logsource:
    category: file_event
    product: windows
detection:
    selection_path:
        TargetFilename|contains:
            - '\Microsoft\Windows\INetCache\Content.Outlook\'
    selection_suspicious_names:
       TargetFileName|contains:
            - 'bonus'
            - 'payout'
            - 'layoff'
            - 'termination'
            - 'urgent'
            - 'immediate'
            - 'confidential'
            - 'invoice'
            - 'salary'
            - 'payment'
            - 'results'
            - 'award'
            - 'audit'
            - 'project'
            - 'official'
            - 'legal'
            - 'subpoena'
            - 'money'
            - 'review'
            - 'transaction'
    selection_extensions:
       TargetFileName|endswith:
           - '.exe'
           - '.zip'
           - '.js'
           - '.vbs'
           - '.docm'
           - '.xlsm'
           - '.pptm'
    condition: selection_keywords and selection_extensions
level: high
