title: Setting/Adding Windows Defender Preferences via PowerShell 
id: a6664a4e-8d81-4b5b-b149-1ecaba58e4ba
related:
    - id: f601d53d-4bf7-43fe-88da-b960acea31ea
      type: similar
status: experimental
description: Detects the manipulation of Windows Defender preferences using Set-MpPreference PowerShell cmdlet.
references:
    - https://superuser.com/questions/1775446/powershell-how-to-add-exclusions-for-defender#:~:text=Add%2DMpPreference%20%2DExclusionPath%20%22%25HOMEPATH%25%5C.,%2DExclusionPath%20%22%25HOMEPATH%25%5C.
    - https://learn.microsoft.com/en-us/powershell/module/defender/add-mppreference?view=windowsserver2022-ps

author: Inovasys
date: 2023/08/31

tags:
    - attack.defense_evasion
    - attack.t1562.001

logsource:
    product: windows
    category: ps_script
detection:
    selection_cmdlets:
        ScriptBlockText|contains: 
            - 'Add-MpPreference'
            - 'Set-MpPreference'
    condition: selection_cmdlets
falsepositives:
    - Legitimate Defender manipulation by administrators
level: high
---
title: Setting/Adding Windows Defender Preferences via PowerShell 
id: f601d53d-4bf7-43fe-88da-b960acea31ea
status: experimental
related:
    - id: a6664a4e-8d81-4b5b-b149-1ecaba58e4ba
      type: similar
description: Detects the manipulation of Windows Defender preferences using Set-MpPreference PowerShell cmdlet.
references:
    - https://superuser.com/questions/1775446/powershell-how-to-add-exclusions-for-defender#:~:text=Add%2DMpPreference%20%2DExclusionPath%20%22%25HOMEPATH%25%5C.,%2DExclusionPath%20%22%25HOMEPATH%25%5C.
    - https://learn.microsoft.com/en-us/powershell/module/defender/add-mppreference?view=windowsserver2022-ps

author: Inovasys
date: 2023/08/31

tags:
    - attack.defense_evasion
    - attack.t1562.001

logsource:
    product: windows
    category: process_creation
detection:
    selection_exec:
        - Image|endswith: '\powershell.exe'
        - OriginalFileName: 'PowerShell.EXE'
    selection_cmdlets:
        CommandLine|contains:
            - 'Add-MpPreference'
            - 'Set-MpPreference'
    condition: all of selection_*
falsepositives:
    - Legitimate Defender manipulation by administrators
level: high