title: LSASS Mimikatz Access
id: 3ca4f257-68e3-4779-bdc7-78b5f6d62e4f
status: experimental
description: Detects suspicious LSASS Access from Mimikatz via commandline arguments.
references:
    - https://www.deepinstinct.com/blog/lsass-memory-dumps-are-stealthier-than-ever-before
    - https://book.hacktricks.xyz/windows-hardening/stealing-credentials/credentials-mimikatz

tags:
    - inovasys.public
    - attack.credential_access
    - attack.t1003.001

author: Inovasys
date: 2023/08/22

logsource:
    category: process_creation
    product: windows
detection:
    mimikatz_launched_original_name:
        - Image|endswith: '\mimikatz.exe'
        - OriginalFileName: 'mimikatz.exe'
    mimikatz_company:
        Company: 'gentilkiwi (Benjamin DELPY)'
    mimikatz_access_commands:
        CommandLine|contains:
            - 'sekurlsa::logonpasswords'
            - 'lsadump::lsa'
            - 'lsadump::setntlm'
            - 'lsadump::sam'
            - 'lsadump::setntlm'
            - 'lsadump::secrets'
            - 'privilege::debug'
            - 'sekurlsa::minidump'
            - 'kerberos::golden'
            - 'kerberos::ptt'
    condition: 1 of mimikatz_*
falsepositives:
    - None
level: high
---
title: Kerberos Ticket Files
id: a4cf7e8b-4a78-4dd3-8fac-c08dc64dfca7
status: experimental
description: Detect the creation of .kirbi files, commonly utilized by tools like Mimikatz, for the purpose of stealing and forging Kerberos tickets.
references:
    - https://redcanary.com/threat-detection-report/threats/mimikatz/
author: Inovasys
date: 2024/03/27
tags:
    - inovasys.public
    - attack.credential_access
logsource:
    category: file_event
    product: windows
detection:
    kerberos_Ticket:
        TargetFilename|endswith: '.kirbi'
    condition: kerberos_Ticket
falsepositives:
    - Unknown
level: low