title: Suspicious Network reconnaissance from Unusual Locations
id: a29c1813-ab1f-4dde-b489-330b952e91ae
status: test
description: |
   Detects the execution of network discovery commands from temporary directories
   or user download locations. Adversaries frequently stage or execute malicious
   tooling from these paths after initial access or delivery.
   The use of built-in utilities such as ipconfig, netsh, and other network-enumeration
   commands from non-standard execution locations may indicate reconnaissance
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1016/T1016.md
author: frack113, Christopher Peacock '@securepeacock', SCYTHE '@scythe_io'
date: 2021-12-07
modified: 2025-12-01
tags:
  - attack.discovery
  - attack.t1016
logsource:
  category: process_creation
  product: windows

detection:
  selection_network_cmds:
    CommandLine|contains:
      - 'ipconfig'
      - 'netsh interface show'
      - 'arp -a'
      - 'nbtstat -n'
      - 'net config'
      - 'route print'
      - 'netstat '
      - 'net use'
      - 'net view'
      - 'wmic nicconfig'
      - 'Get-NetAdapter'
      - 'Get-NetIPConfiguration'
      - 'Get-NetRoute'

  # Suspicious execution paths: Temp and Downloads
  selection_temp_or_download:
    Image|contains:
      - '\AppData\Local\Temp\'
      - '\AppData\Roaming\Temp\'
      - '\Windows\Temp\'
      - '\Users\Public\'
      - '\Downloads\'

  condition: selection_network_cmds and selection_temp_or_download

falsepositives:
  - Users legitimately running downloaded administration tools
  - Software installers or update processes
level: medium
