id: 04f3f047-a6d1-4840-9a89-dcae8001519f
title: Files Downloaded Using PowerShell
status: experimental
description: Detects the use of PowerShell commands to download files
references:
    - https://www.huntress.com/blog/third-party-pharmaceutical-vendor-linked-to-pharmacy-and-health-clinic-cyberattack
    - https://www.trendmicro.com/en_us/research/24/b/threat-actor-groups-including-black-basta-are-exploiting-recent-.html
author: Inovasys
date: 2024/02/27
tags:
    - inovasys.public
    - attack.execution
    - attack.command_and_control
    - attack.t1105
    - attack.t1059.001

logsource:
    category: process_creation
    product: windows

detection:
    selection_img:
        - Image|endswith: '\powershell.exe'
        - OriginalFileName: 'PowerShell.EXE'

    selection_download_cmdlts:
        CommandLine|contains:
            - Invoke-WebRequest
            - iwr
            - i'w'r
            - Invoke-RestMethod
            - irm
            - i'r'm
            - wget

    selection_download_by_netwebclient:
        CommandLine|contains:
            - Net.WebClient

    netwebclient_keywords:
        CommandLine|contains:
            - DownloadFile(
            - DownloadString
            - DownloadData

    condition: selection_img and ((selection_download_cmdlts) or (selection_download_by_netwebclient and netwebclient_keywords))

falsepositives: Legitimate administrator used powershell to download a file
level: medium

--- # Script block

id: 7e5555af-10bc-4527-b67c-370ee0fd7582
title: Files Downloaded Using PowerShell
status: experimental
description: Detects the use of PowerShell commands to download files
references:
    - https://www.huntress.com/blog/third-party-pharmaceutical-vendor-linked-to-pharmacy-and-health-clinic-cyberattack
author: Inovasys
date: 2024/02/27
tags:
    - inovasys.public
    - attack.execution
    - attack.command_and_control
    - attack.t1105
    - attack.t1059.001

logsource:
    product: windows
    category: ps_script
    definition: 'Requirements: Script Block Logging must be enabled'

detection:
    selection_download_cmdlts:
        ScriptBlockText|contains:
            - Invoke-WebRequest
            - iwr
            - i'w'r
            - Invoke-RestMethod
            - irm
            - i'r'm
            - wget
            - curl

    selection_download_by_netwebclient:
        ScriptBlockText|contains:
            - Net.WebClient

    netwebclient_keywords:
        ScriptBlockText|contains:
            - DownloadFile(
            - DownloadString
            - DownloadData

    condition: (selection_download_cmdlts) or (selection_download_by_netwebclient and netwebclient_keywords)

falsepositives: Legitimate administrator used powershell to download a file
level: medium

