title: Loading Malicious Extensions 
id: a1d83ad8-e593-4905-8a8c-4bf3a3a1c801
status: experimental
description: Detect the automatic loading of extensions in  chromium based browsers without user interaction, similar to what was observed in the Chrome Loader and Smachjacker threats.
references:
    - https://redcanary.com/blog/chromeloader/
    - https://redcanary.com/threat-detection-report/threats/smashjacker/
author: Inovasys
date: 2024/03/27
tags:
    - attack.persistence
    - attack.t1176
logsource:
    category: process_creation
    product: windows
detection:
    loading_extension:
        Image|endswith: 
            - '\chrome.exe'
            - '\msedge.exe'
            - '\brave.exe'
            - '\opera.exe'
        CommandLine|contains:
            - '--load-extension'
    condition: loading_extension
falsepositives:
    - Unknown
level: high