title: Detects force downloading browser extentions using registry
id: e18fcd8d-629c-44da-8262-df5eb9dedd3b
status: experimental
description: Detects force downloading browser extention using registry modifications, this technique can be used by adversaries to install malicious extentions
references:
    - https://reasonlabs.com/research/new-widespread-extension-trojan-malware-campaign

author: Inovasys
date: 2024/09/04
tags:
    - inovasys.public
    - attack.defense_evasion
    - attack.t1112
logsource:
    product: windows
    category: registry_event
detection:
    extention_registry_entry:
        ObjectName|contains:
            - 'SOFTWARE\Policies\Google\Chrome\ExtensionInstallForceList'
            - 'SOFTWARE\Policies\Microsoft\Edge\ExtensionInstallForceList'
    condition: extention_registry_entry
falsepositives:
    - unexpected to produce false positives
level: medium
