id: 724e7d99-be12-48a7-9589-6e06dbf859e8
title: Proxy Execution using signed windows binary Gpscript.exe
status: experimental
description: Detects instances of GPscript execution, a legitimate signed binary used to run logon or startup scripts as configured within Group Policy settings. which can potentially lead to the execution of malicious scripts.
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Gpscript/
    - https://oddvar.moe/2018/04/27/gpscript-exe-another-lolbin-to-the-list/
author: Inovasys
date: 2023/10/8
tags:
    - attack.defense_evasion
    - attack.t1218

logsource:
    category: process_creation
    product: windows

detection:
    selection_img:
        - Image|endswith: 'gpscript.exe'
        - OriginalFileName: 'GPSCRIPT.EXE'

    selection_commandline:
        CommandLine|contains:
            - '/logon'
            - '/startup'

    filter_svchost:
        ParentCommandLine:
            - 'C:\Windows\system32\svchost.exe -k netsvcs -p'
            - 'C:\windows\system32\svchost.exe -k netsvcs -p -s gpsvc'

    condition: selection_img and selection_commandline and not 1 of filter_*

falsepositives:
    - Legitimate administrator or process used Gpscript.exe to distribute logon scripts via group policy
level: low  
