title: vbs File Added to Registry Run Key
id: c03511a3-2678-4e30-8314-6641aaff913a
status: experimental
description: Detects potential persistence where a .vbs file is added to a Windows Registry Run key. This technique may be used by attackers to execute a malicious file (e.g., via cmd.exe or PowerShell) at user logon using a shortcut link.
references:
    -https://unit42.paloaltonetworks.com/kimjongrat-stealer-variant-powershell/
author: Inovasys_Mahmoud_Osama
date: 2025-06-24
tags:
    - attack.persistence
    - attack.t1547.001
    - inovasys.inspired_by_TI
logsource:
    category: registry_event
    product: windows
detection:
    selection:
        TargetObject|contains:
            - '\Software\Microsoft\Windows\CurrentVersion\Run'
        Details|contains: '.vbs'
    condition: selection
falsepositives:
    - Unknown
level: medium
